Revit 2027 API
WorksharingDisplaySettings.CanUserHaveOverrides Method
 Checks whether a single username can have customized graphic overrides.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public bool CanUserHaveOverrides(
	string username
)
Public Function CanUserHaveOverrides (
	username As String
) As Boolean
public:
bool CanUserHaveOverrides(
	String^ username
)
member CanUserHaveOverrides :
        username : string -> bool
Parameters
username String
 The username to check.
Return Value
Boolean
 False if the username is on the list of removed users, True otherwise.
Exceptions
Exception | Condition
ArgumentNullException |  A non-optional argument was null
Remarks
 Only users that have not been removed can have overrides. Once it is removed, a username must be restored before its associated graphic overrides can be customized.
See Also
Reference
WorksharingDisplaySettings Class
Autodesk.Revit.DB Namespace